#include <string>

#include "parser.hpp"
using namespace parser;

#include "gtest/gtest.h"
using namespace ::testing;
//手元	名詞,一般,*,*,*,*,手元,テモト,テモト
//に	助詞,格助詞,一般,*,*,*,に,ニ,ニ
//広げ	動詞,自立,*,*,一段,未然形,広げる,ヒロゲ,ヒロゲ
//られ	動詞,接尾,*,*,一段,連用形,られる,ラレ,ラレ
//た	助動詞,*,*,*,特殊・タ,基本形,た,タ,タ
//紙面	名詞,一般,*,*,*,*,紙面,シメン,シメン
//に	助詞,格助詞,一般,*,*,*,に,ニ,ニ
//、	記号,読点,*,*,*,*,、,、,、
//ゆるり	副詞,助詞類接続,*,*,*,*,ゆるり,ユルリ,ユルリ
//と	助詞,副詞化,*,*,*,*,と,ト,ト
//視線	名詞,一般,*,*,*,*,視線,シセン,シセン
//を	助詞,格助詞,一般,*,*,*,を,ヲ,ヲ
//這わ	動詞,自立,*,*,五段・ワ行促音便,未然形,這う,ハワ,ハワ
//せる	動詞,接尾,*,*,一段,基本形,せる,セル,セル
//一	名詞,数,*,*,*,*,一,イチ,イチ
//人	名詞,接尾,助数詞,*,*,*,人,ニン,ニン
//の	助詞,連体化,*,*,*,*,の,ノ,ノ
//佳人	名詞,一般,*,*,*,*,佳人,カジン,カジン
//EOS
//手元	名詞,一般,*,*,*,*,手元,テモト,テモト
//に	助詞,格助詞,一般,*,*,*,に,ニ,ニ
//広げ	動詞,自立,*,*,一段,未然形,広げる,ヒロゲ,ヒロゲ
//られ	動詞,接尾,*,*,一段,連用形,られる,ラレ,ラレ
//た	助動詞,*,*,*,特殊・タ,基本形,た,タ,タ
//紙	名詞,一般,*,*,*,*,紙,カミ,カミ
//
//かわいい  形容詞,自立,*,*,形容詞・イ段,基本形,かわいい,カワイイ,カワイイ
TEST(LibParser, MecabParseWorks) {
    Mecab mecab;
    const std::string str(u8"かわいい");

    mecab.parse(str);
}
